Repository: jjosh102/json-to-csharp-poco
Catalog: src/Resources/Localizer.*.resx
Languages: id, it, ja, ko, th, tl, vi

# Settings_Title
source: Settings
id: Pengaturan
it: Impostazioni
ja: 設定
ko: 설정
th: การตั้งค่า
tl: Mga Setting
vi: Cài đặt

# Theme_Title
source: Theme
id: Tema
it: Tema
ja: テーマ
ko: 테마
th: ธีม
tl: Tema
vi: Giao diện

# Theme_Description
source: Choose your preferred appearance
id: Pilih tampilan yang Anda sukai
it: Scegli l'aspetto preferito
ja: お好みの外観を選択してください
ko: 원하는 외관을 선택하세요
th: เลือกการแสดงผลที่คุณต้องการ
tl: Piliin ang iyong gustong itsura
vi: Chọn giao diện bạn thích

# Theme_Light
source: Light
id: Terang
it: Chiaro
ja: ライト
ko: 라이트
th: สว่าง
tl: Liwanag
vi: Sáng

# Theme_Dark
source: Dark
id: Gelap
it: Scuro
ja: ダーク
ko: 다크
th: มืด
tl: Madilim
vi: Tối

# SaveSettings_Title
source: Save Settings
id: Simpan Pengaturan
it: Salva Impostazioni
ja: 設定を保存
ko: 설정 저장
th: บันทึกการตั้งค่า
tl: I-save ang Mga Setting
vi: Lưu cài đặt

# SaveSettings_Description
source: Remember your settings for next time
id: Ingat pengaturan Anda untuk penggunaan berikutnya
it: Ricorda le tue impostazioni per la prossima volta
ja: 次回のために設定を保存する
ko: 다음을 위해 설정을 저장하세요
th: จดจำการตั้งค่าของคุณสำหรับครั้งถัดไป
tl: Tandaan ang iyong mga setting para sa susunod na pagkakataon
vi: Ghi nhớ cài đặt của bạn cho lần tiếp theo

# SaveEditor_Title
source: Save Editor Content
id: Simpan Konten Editor
it: Salva Contenuto Editor
ja: エディタの内容を保存
ko: 편집기 내용 저장
th: บันทึกเนื้อหาในโปรแกรมแก้ไข
tl: I-save ang Nilalaman ng Editor
vi: Lưu nội dung chỉnh sửa

# SaveEditor_Description
source: Do you want to save the content of your editor for future sessions?
id: Apakah Anda ingin menyimpan konten editor Anda untuk sesi mendatang?
it: Vuoi salvare il contenuto del tuo editor per le sessioni future?
ja: エディタの内容を今後のセッションのために保存しますか？
ko: 향후 세션을 위해 편집기 내용을 저장하시겠습니까?
th: คุณต้องการบันทึกเนื้อหาในโปรแกรมแก้ไขของคุณสำหรับการใช้งานครั้งถัดไปหรือไม่?
tl: Nais mo bang i-save ang nilalaman ng iyong editor para sa mga susunod na sesyon?
vi: Bạn có muốn lưu nội dung chỉnh sửa của mình cho các phiên làm việc sau không?

# SaveEditor_Note
source: Your data will be stored locally and should not include confidential information. You can disable this feature if needed.
id: Data Anda akan disimpan secara lokal dan seharusnya tidak berisi informasi rahasia. Anda dapat menonaktifkan fitur ini jika diperlukan.
it: I tuoi dati saranno memorizzati localmente e non dovrebbero includere informazioni riservate. Puoi disabilitare questa funzione se necessario.
ja: データはローカルに保存され、機密情報を含めないようにしてください。必要に応じてこの機能を無効にできます。
ko: 데이터는 로컬에 저장되며 기밀 정보를 포함해서는 안 됩니다. 필요한 경우 이 기능을 비활성화할 수 있습니다.
th: ข้อมูลของคุณจะถูกจัดเก็บในเครื่องและไม่ควรมีข้อมูลลับ คุณสามารถปิดฟีเจอร์นี้ได้หากต้องการ
tl: Ang iyong data ay itatago nang lokal at hindi dapat maglaman ng mga kumpidensyal na impormasyon. Maaari mong i-disable ang feature na ito kung kinakailangan.
vi: Dữ liệu của bạn sẽ được lưu trữ cục bộ và không nên bao gồm thông tin bảo mật. Bạn có thể tắt tính năng này nếu cần.

# TypeSettings_Title
source: Type Settings
id: Pengaturan Tipe
it: Impostazioni Tipo
ja: 型設定
ko: 유형 설정
th: การตั้งค่าประเภท
tl: Mga Setting ng Uri
vi: Cài đặt kiểu

# UseRecords_Label
source: Use Records
id: Gunakan Rekaman
it: Usa Record
ja: レコードを使用
ko: 레코드 사용
th: ใช้เรคคอร์ด
tl: Gumamit ng Mga Talaan
vi: Sử dụng Bản ghi

# UsePrimaryConstructor_Label
source: Use Primary Constructor
id: Gunakan Konstruktor Utama
it: Usa Costruttore Primario
ja: プライマリコンストラクタを使用
ko: 기본 생성자 사용
th: ใช้คอนสตรัคเตอร์หลัก
tl: Gumamit ng Pangunahing Constructor
vi: Sử dụng Constructor chính

# PropertyAccess_Label
source: Property Access
id: Akses Properti
it: Accesso Proprietà
ja: プロパティアクセス
ko: 속성 접근
th: การเข้าถึงคุณสมบัติ
tl: Access sa Property
vi: Truy cập Thuộc tính

# ArrayType_Label
source: Array Type
id: Tipe Array
it: Tipo Array
ja: 配列型
ko: 배열 유형
th: ประเภทอาเรย์
tl: Uri ng Array
vi: Kiểu Mảng

# PropertySettings_Title
source: Property Settings
id: Pengaturan Properti
it: Impostazioni Proprietà
ja: プロパティ設定
ko: 속성 설정
th: การตั้งค่าคุณสมบัติ
tl: Mga Setting ng Property
vi: Cài đặt thuộc tính

# AddJsonAttribute_Label
source: Add Json Attribute
id: Tambahkan Atribut JSON
it: Aggiungi Attributo Json
ja: JSON属性を追加
ko: JSON 속성 추가
th: เพิ่มแอตทริบิวต์ JSON
tl: Magdagdag ng Json Attribute
vi: Thêm Thuộc tính JSON

# IsNullable_Label
source: Nullable?
id: Bisa Kosong?
ja: Null許容？
ko: 널 허용?
th: เป็นค่าว่าง?
vi: Có thể null?

# IsRequired_Label
source: Required
id: Dibutuhkan
it: Obbligatorio
ja: 必須
ko: 필수
th: จำเป็น
tl: Kinakailangan
vi: Bắt buộc

# DefaultValues_Label
source: Initialized Default Values
id: Nilai Default Diinisialisasi
it: Valori Predefiniti Inizializzati
ja: 初期化されたデフォルト値
ko: 초기화된 기본값
th: ค่าตั้งต้นที่ถูกกำหนด
tl: Mga Default na Halaga na Na-initialize
vi: Giá trị mặc định đã khởi tạo

# NamingSettings_Title
source: Naming Settings
id: Pengaturan Penamaan
it: Impostazioni Nome
ja: 命名設定
ko: 이름 설정
th: การตั้งค่าการตั้งชื่อ
tl: Mga Setting ng Pagpapangalan
vi: Cài đặt Tên

# Namespace_Label
source: Namespace
ja: 名前空間
ko: 네임스페이스
th: เนมสเปซ

# RootName_Label
source: Root Name
id: Nama Root
it: Nome Root
ja: ルート名
ko: 루트 이름
th: ชื่อราก
tl: Pangalan ng Root
vi: Tên gốc

# CopyCode_Button
source: Copy Code
id: Salin Kode
it: Copia Codice
ja: コードをコピー
ko: 코드 복사
th: คัดลอกโค้ด
tl: Kopyahin ang Code
vi: Sao chép mã

# Convert_Button
source: Convert
id: Konversi
it: Converti
ja: 変換
ko: 변환
th: แปลง
tl: I-convert
vi: Chuyển đổi

# Converting_Label
source: Converting...
id: Mengonversi...
it: Conversione in corso...
ja: 変換中...
ko: 변환 중...
th: กำลังแปลง...
tl: Nagko-convert...
vi: Đang chuyển đổi...

# JsonEditor_Label
source: JSON Editor
id: Editor JSON
it: Editor JSON
ja: JSONエディタ
ko: JSON 편집기
th: ตัวแก้ไข JSON
vi: Trình chỉnh sửa JSON

# CsharpEditor_Label
source: C# Editor
id: Editor C#
it: Editor C#
ja: C#エディタ
ko: C# 편집기
th: ตัวแก้ไข C#
vi: Trình chỉnh sửa C#

source: Language
id: Bahasa
it: Lingua
ja: 言語
ko: 언어
th: ภาษา
tl: Wika
vi: Ngôn ngữ

# Select_Preferred_Language
source: Select your preferred language
id: Pilih bahasa pilihan Anda
it: Seleziona la tua lingua preferita
ja: 希望する言語を選択してください
ko: 선호하는 언어를 선택하세요
th: เลือกภาษาที่คุณต้องการ
tl: Piliin ang iyong gustong wika
vi: Chọn ngôn ngữ bạn thích

# ClipboardCopySuccess
source: C# code copied to clipboard
id: Kode C# berhasil disalin ke clipboard
it: Codice C# copiato negli appunti
ja: C#コードがクリップボードにコピーされました
ko: C# 코드가 클립보드에 복사되었습니다
th: โค้ด C# ถูกคัดลอกไปยังคลิปบอร์ดแล้ว
tl: Nakopya ang C# code sa clipboard
vi: Mã C# đã được sao chép vào clipboard

# JsonConversionError
source: Error converting JSON to C# POCO
id: Kesalahan mengonversi JSON ke C# POCO
it: Errore durante la conversione da JSON a C# POCO
ja: JSONからC# POCOへの変換エラー
ko: JSON을 C# POCO로 변환하는 중 오류 발생
th: เกิดข้อผิดพลาดในการแปลง JSON เป็น C# POCO
tl: May error sa pag-convert ng JSON sa C# POCO
vi: Lỗi chuyển đổi JSON sang POCO C#

# JsonConversionSuccess
source: JSON converted to C# POCO
id: JSON berhasil dikonversi ke C# POCO
it: JSON convertito in C# POCO
ja: JSONがC# POCOに変換されました
ko: JSON이 C# POCO로 변환되었습니다
th: แปลง JSON เป็น C# POCO สำเร็จ
tl: Na-convert ang JSON sa C# POCO
vi: JSON đã được chuyển đổi sang POCO C#

# ConversionSuccess
source: Conversion Successful
id: Konversi Berhasil
it: Conversione riuscita
ja: 変換成功
ko: 변환 성공
th: การแปลงสำเร็จ
tl: Matagumpay ang Pag-convert
vi: Chuyển đổi thành công

source: Conversion Failed
id: Konversi Gagal
it: Conversione fallita
ja: 変換失敗
ko: 변환 실패
th: การแปลงล้มเหลว
tl: Nabigo ang Pag-convert
vi: Chuyển đổi thất bại

# EnterJson
source: Please enter JSON to convert
id: Harap masukkan JSON untuk dikonversi
it: Inserisci il JSON da convertire
ja: 変換するJSONを入力してください
ko: 변환할 JSON을 입력하세요
th: โปรดป้อน JSON เพื่อแปลง
tl: Pakilagay ang JSON para ma-convert
vi: Vui lòng nhập JSON để chuyển đổi

# UseFileScoped_Label
source: Use File Scoped
ko: 파일 범위 사용
th: ใช้ขอบเขตไฟล์

# UploadFile_Label
source: Upload File
th: อัปโหลดไฟล์

source: Error reading file:
th: ข้อผิดพลาดในการอ่านไฟล์:

source: File Upload Error
th: ข้อผิดพลาดในการอัปโหลดไฟล์
